

In this subsection, you will learn essential DataFrame operations, including:

- Selecting columns  
- Adding new columns  
- Deleting columns  
- Summary statistics  
- Sorting values  
- Setting and resetting index  

These operations are the foundation of almost every real-world pandas workflow.

üü¶ 1. Creating Sample Data

In [11]:
import pandas as pd

data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eva"],
    "Age": [24, 19, 22, 28, 31],
    "Score": [88, 75, 90, 65, 80],
    "City": ["Toronto", "Montreal", "Vancouver", "Calgary", "Toronto"]
}

df = pd.DataFrame(data)
df

      Name  Age  Score       City
0    Alice   24     88    Toronto
1      Bob   19     75   Montreal
2  Charlie   22     90  Vancouver
3    David   28     65    Calgary
4      Eva   31     80    Toronto

üü¶ 2. Selecting Columns

2.1 Single Column

In [12]:
df["Name"]

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

2.2 Multiple Columns

In [13]:
df[["Name", "Score"]]

      Name  Score
0    Alice     88
1      Bob     75
2  Charlie     90
3    David     65
4      Eva     80

2.3 Using dot notation

In [14]:
df.Name

0      Alice
1        Bob
2    Charlie
3      David
4        Eva
Name: Name, dtype: object

üü¶ 3. Adding New Columns

3.1 Add with direct assignment

In [15]:
df["Passed"] = df["Score"] >= 70
df

      Name  Age  Score       City  Passed
0    Alice   24     88    Toronto    True
1      Bob   19     75   Montreal    True
2  Charlie   22     90  Vancouver    True
3    David   28     65    Calgary   False
4      Eva   31     80    Toronto    True

3.2 Add using calculations

In [16]:
df["Score_Percent"] = df["Score"] / 100
df

      Name  Age  Score       City  Passed  Score_Percent
0    Alice   24     88    Toronto    True           0.88
1      Bob   19     75   Montreal    True           0.75
2  Charlie   22     90  Vancouver    True           0.90
3    David   28     65    Calgary   False           0.65
4      Eva   31     80    Toronto    True           0.80

3.3 Add from external list

In [17]:
df["Rank"] = [1, 2, 3, 4, 5]
df

      Name  Age  Score       City  Passed  Score_Percent  Rank
0    Alice   24     88    Toronto    True           0.88     1
1      Bob   19     75   Montreal    True           0.75     2
2  Charlie   22     90  Vancouver    True           0.90     3
3    David   28     65    Calgary   False           0.65     4
4      Eva   31     80    Toronto    True           0.80     5

üü¶ 4. Deleting Columns

4.1 Drop column (temporary)

In [18]:
df.drop(columns=["Score_Percent"])

      Name  Age  Score       City  Passed  Rank
0    Alice   24     88    Toronto    True     1
1      Bob   19     75   Montreal    True     2
2  Charlie   22     90  Vancouver    True     3
3    David   28     65    Calgary   False     4
4      Eva   31     80    Toronto    True     5

4.5 Drop permanently

In [19]:
df.drop(columns=["Score_Percent"], inplace=True)
df

      Name  Age  Score       City  Passed  Rank
0    Alice   24     88    Toronto    True     1
1      Bob   19     75   Montreal    True     2
2  Charlie   22     90  Vancouver    True     3
3    David   28     65    Calgary   False     4
4      Eva   31     80    Toronto    True     5

üü¶ 5. Summary Statistics

5.1 Default describe

In [20]:
df.describe()

             Age      Score      Rank
count   5.000000   5.000000  5.000000
mean   24.800000  79.600000  3.000000
std     4.764452  10.163661  1.581139
min    19.000000  65.000000  1.000000
25%    22.000000  75.000000  2.000000
50%    24.000000  80.000000  3.000000
75%    28.000000  88.000000  4.000000
max    31.000000  90.000000  5.000000

5.2 Custom statistics

In [21]:
df["Score"].mean(), df["Score"].max(), df["Score"].min()

(79.6, 90, 65)

üü¶ 6. Sorting Data

6.1 Sort by one column

In [22]:
df.sort_values(by="Score")

      Name  Age  Score       City  Passed  Rank
3    David   28     65    Calgary   False     4
1      Bob   19     75   Montreal    True     2
4      Eva   31     80    Toronto    True     5
0    Alice   24     88    Toronto    True     1
2  Charlie   22     90  Vancouver    True     3

6.2 Sort descending

In [23]:
df.sort_values(by="Score", ascending=False)

      Name  Age  Score       City  Passed  Rank
2  Charlie   22     90  Vancouver    True     3
0    Alice   24     88    Toronto    True     1
4      Eva   31     80    Toronto    True     5
1      Bob   19     75   Montreal    True     2
3    David   28     65    Calgary   False     4

6.3 Sort by multiple columns

In [24]:
df.sort_values(by=["City", "Score"])

      Name  Age  Score       City  Passed  Rank
3    David   28     65    Calgary   False     4
1      Bob   19     75   Montreal    True     2
4      Eva   31     80    Toronto    True     5
0    Alice   24     88    Toronto    True     1
2  Charlie   22     90  Vancouver    True     3

üü¶ 7. Setting and Resetting Index

7.1 Set index

In [25]:
df_indexed = df.set_index("Name")
df_indexed

         Age  Score       City  Passed  Rank
Name
Alice     24     88    Toronto    True     1
Bob       19     75   Montreal    True     2
Charlie   22     90  Vancouver    True     3
David     28     65    Calgary   False     4
Eva       31     80    Toronto    True     5

7.2 Reset index

In [26]:
df_reset = df_indexed.reset_index()
df_reset

      Name  Age  Score       City  Passed  Rank
0    Alice   24     88    Toronto    True     1
1      Bob   19     75   Montreal    True     2
2  Charlie   22     90  Vancouver    True     3
3    David   28     65    Calgary   False     4
4      Eva   31     80    Toronto    True     5

üü¶ 8. Bonus: Renaming Columns

8.1 Rename select columns

In [27]:
df.rename(columns={"Score": "Final_Score", "Age": "Student_Age"})

      Name  Student_Age  Final_Score       City  Passed  Rank
0    Alice           24           88    Toronto    True     1
1      Bob           19           75   Montreal    True     2
2  Charlie           22           90  Vancouver    True     3
3    David           28           65    Calgary   False     4
4      Eva           31           80    Toronto    True     5

8.2 Rename all columns

In [28]:
df.columns = [col.lower() for col in df.columns]
df

      name  age  score       city  passed  rank
0    Alice   24     88    Toronto    True     1
1      Bob   19     75   Montreal    True     2
2  Charlie   22     90  Vancouver    True     3
3    David   28     65    Calgary   False     4
4      Eva   31     80    Toronto    True     5

## üü¶ 9. Summary

In this subsection, you learned how to:

### üß± Column Operations
- Select single and multiple columns  
- Add new columns using calculations and logic  
- Remove columns safely  

### üìä Data Understanding
- Generate summary statistics (`describe()`, `mean()`, `max()`, `min()`)  

### üîÉ Data Organization
- Sort by one or multiple columns  
- Set and reset DataFrame index  

### ‚≠ê Extra Skill
- Rename columns for cleaner datasets  

You now have full control over DataFrame structure and organization.